const text = `
约购平台商家承诺书

第一部分 诚信经营承诺书
为共同构建诚信、透明的网络消费环境，共同维护公平、规范的网络经营秩序，共同促进约购平台的健康持续发展，本店（本人）特向广大消费者、约购平台店主及约购平台承诺如下：

一、 不参与、不加入、不组建任何交易信用炒作组织（该交易信用包括商品销量、评价、评分等）。
二、 不进行任何交易信用炒作行为，保证每一笔交易内容、交易信用均为真实、可信，绝无虚构、炒作行为。
三、 不发布、不传播、不推广任何有关交易信用炒作的违规信息，并积极举报此类违规信息。
四、 积极接受广大消费者、约购平台店主及约购平台的监督，严格遵守、积极维护交易信用体系的各项规则。
五、 若本店违反约购平台的各项规则，本店愿意接受相应处理措施，并承担因此引发的相关责任。
本店郑重承诺：本店将始终恪守上述承诺，不进行任何形式的交易信用炒作行为，严格遵守国家法律法规及约购平台的相关规定，诚信、公平、规范地开展经营活动。 

第二部分 危险物品合规承诺书

本店铺已明确知晓下述内容：依照《互联网危险物品信息发布管理规定》，危险物品系指枪支弹药、爆炸物品、剧毒化学品、易制爆危险化学品和其他危险化学品、放射性物品、核材料、管制器具等能够危及人身安全和财产安全的物品。约购平台已经制定相应的禁售规则，禁止商家在平台发布上述危险物品信息、交易上述危险物品。
本店铺郑重承诺如下：严格遵守《反恐怖主义法》、《网络安全法》、《广告法》、《互联网信息服务管理办法》、《计算机信息网络国际联网安全保护管理办法》、《枪支管理法》、《民用爆炸物品安全管理条例》、《危险化学品安全管理条例》和《互联网危险物品信息发布管理规定》等法律法规和政策文件的规定，并保证履行以下安全责任：
一、自觉遵守国家现行有关安全管理、危险物品管理的法律法规和政策文件规定，积极配合有关监管部门开展的安全监督与执法检查活动。
二、自觉遵守平台关于危险物品的相关禁售规则，积极开展商品信息的自检自查工作，不发布、不传播、不交易上述危险物品，依规配合平台针对危险物品开展的商品信息与交易管理工作。
三、在商品信息发布与交易履行过程中，不弄虚作假规避有关监管部门及平台针对危险物品的管理工作。
四、若所售物品并非危险物品，但其可用于制造使用危险物品或可用于非法用途，绝不对相关危险物品的制造使用方法及非法用途进行介绍。若在交易中发现买方存在违法犯罪嫌疑，立即停止与其交易，并将相关线索上报相关监管部门或平台管理部门。 
本店铺已知晓上述义务，并做出安全责任承诺。若本人不履行上述法定义务与责任承诺，导致违法犯罪活动发生或其他损害后果，本人将依法承担相应的法律责任。 `;

export default text;